nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mz1024efm064.h
PLIB_INLINE_API void PLIB_ADCHS_AnalogInputModeSelect(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput, ADCHS_INPUT_MODE mode)
{
     ADCHS_AnalogInputModeSelect_Default(index, analogInput, mode);
}

PLIB_INLINE_API ADCHS_INPUT_MODE PLIB_ADCHS_AnalogInputModeGet(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputModeGet_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsAnalogInputModeControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsAnalogInputModeControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputLevelTriggerSet(ADCHS_MODULE_ID index, ADCHS_CLASS12_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputLevelTriggerSet_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEdgeTriggerSet(ADCHS_MODULE_ID index, ADCHS_CLASS12_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEdgeTriggerSet_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputTriggerSourceSelect(ADCHS_MODULE_ID index, ADCHS_CLASS12_AN_INPUT_ID inputId, ADCHS_TRIGGER_SOURCE triggerSource)
{
     ADCHS_AnalogInputTriggerSourceSelect_Default(index, inputId, triggerSource);
}

PLIB_INLINE_API void PLIB_ADCHS_GlobalSoftwareTriggerEnable(ADCHS_MODULE_ID index)
{
     ADCHS_GlobalSoftwareTriggerEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_GlobalLevelSoftwareTriggerEnable(ADCHS_MODULE_ID index)
{
     ADCHS_GlobalLevelSoftwareTriggerEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_GlobalLevelSoftwareTriggerDisable(ADCHS_MODULE_ID index)
{
     ADCHS_GlobalLevelSoftwareTriggerDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TriggerSuspendEnable(ADCHS_MODULE_ID index)
{
     ADCHS_TriggerSuspendEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TriggerSuspendDisable(ADCHS_MODULE_ID index)
{
     ADCHS_TriggerSuspendDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTriggerControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTriggerControl_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ChannelTriggerSampleSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, ADCHS_CHANNEL_TRIGGER_SAMPLING_SEL sampSel)
{
     return ADCHS_ChannelTriggerSampleSelect_Default(index, channelID, sampSel);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTriggerSampleControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTriggerSampleControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_EarlyInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_EarlyInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_EarlyInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_EarlyInterruptDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEarlyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEarlyInterruptEnable_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEarlyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEarlyInterruptDisable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputEarlyInterruptIsReady(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputEarlyInterruptIsReady_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsEarlyInterruptControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsEarlyInterruptControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareSamplingStart(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareSamplingStart_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareSamplingStop(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareSamplingStop_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareConversionStart(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareConversionStart_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareConversionInputSelect(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID anInput)
{
     ADCHS_SoftwareConversionInputSelect_Default(index, anInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsManualControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsManualControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ControlRegistersCanBeUpdatedInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ControlRegistersCanBeUpdatedInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ControlRegistersCanBeUpdatedInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_ControlRegistersCanBeUpdatedInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ControlRegistersCanBeUpdated(ADCHS_MODULE_ID index)
{
     return ADCHS_ControlRegistersCanBeUpdated_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsUpdateReadyControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsUpdateReadyControl_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ChannelInputSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, ADCHS_CHANNEL_INP_SEL sel)
{
     return ADCHS_ChannelInputSelect_Default(index, channelID, sel);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelInputSelectControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelInputSelectControl_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ExternalConversionRequestEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ExternalConversionRequestEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ExternalConversionRequestDisable(ADCHS_MODULE_ID index)
{
     ADCHS_ExternalConversionRequestDisable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsExternalConversionRequestControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsExternalConversionRequestControl_Unsupported(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Setup(ADCHS_MODULE_ID index, ADCHS_VREF_SOURCE voltageRefSelect, ADCHS_CHARGEPUMP_MODE chargePump, ADCHS_OUTPUT_DATA_FORMAT outputFormat, bool stopInIdle, ADCHS_FAST_SYNC_SYSTEM_CLOCK sysClk, ADCHS_FAST_SYNC_PERIPHERAL_CLOCK periClk, ADCHS_INTERRUPT_BIT_SHIFT_LEFT intVectorShift, uint16_t intVectorBase, ADCHS_CLOCK_SOURCE adcClockSource, int8_t adcClockDivider, ADCHS_WARMUP_CLOCK warmUpClock)
{
     ADCHS_Setup_Default(index, voltageRefSelect, chargePump, outputFormat, stopInIdle, sysClk, periClk, intVectorShift, intVectorBase, adcClockSource, adcClockDivider, warmUpClock);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelSetup(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, ADCHS_DATA_RESOLUTION res, uint8_t channelClockDivider, uint16_t sampleTimeCount, ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK earlyInterruptClk)
{
     ADCHS_ChannelSetup_Default(index, channelID, res, channelClockDivider, sampleTimeCount, earlyInterruptClk);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsConfiguration(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsConfiguration_Default(index);
}

